[
    {
        "text": "Hello, I'm Keith Charlton, a senior at The Pennsylvania State University majoring in Enterprise Technology Integration, set to graduate in May 2024. Balancing a strong academic record with practical experience, I've engaged in several projects that have allowed me to apply a theoretical foundation to complex, real-world challenges."
    },
    {
        "text": "In my academic projects, I've embraced the intricacies of full-stack development and cloud solutions, delivering a mock IMDB website, an AI-enhanced bank risk analysis tool, and a cloud-based web app for class management. These projects honed my technical skills and underlined the importance of clear, logical design and user-centered thinking."
    },
    {
        "text": "As a Classroom Learning Assistant, I facilitate learning for over a hundred students, translating my knowledge into actionable guidance. Leadership roles have further refined my ability to navigate project management and team dynamics effectively."
    },
    {
        "text": "While my professional pursuits are in full swing, I'm also passionate about soccer. It's a sport that teaches resilience, strategy, and teamwork—values that I bring to every project I undertake. Currently, I'm in recovery from an ACL injury (for the second time), which has only strengthened my resolve and focus both on and off the pitch. Both soccer and recovery from a devastating injury has taught me valuable lessons that I continue to use throughout my career."
    },
    {
        "text": "I'm committed to using technology to make a difference, as evidenced by my latest endeavor—a charity project for <a href='https://twmp.org/'>The Warrenton Meeting Place<a>. I am currently redesigning their website to fulfill UI/UX guidelines for their users. As I prepare to transition from academia to the tech industry, I look forward to opportunities where I can contribute to meaningful and impactful tech initiatives."
    },
    {
        "text": "I invite you to follow my journey through my upcoming blog posts, where I'll share insights from the tech world, reflections on collaborative projects, and lessons learned during my recovery. Let's talk about technology, its challenges, and its power to change the world around us."
    }
]